{"module":{"contents":{"data":{}},"title":"Functions","path":"1-Javascript-General-Topics/functions","id":"functions","body":"<h1 id=\"functions\">Functions</h1>\n<h3 id=\"scope-and-closure\">Scope and Closure</h3>\n<ul>\n<li><p>When you first start writing a program in JS, you are in the <code>Global Scope</code>. If we define a variable, it will be defined globally.</p>\n<pre><code class=\"lang-javascript\">const number = 1;\n</code></pre>\n<p>We generally want to avoid globally scoped variables as you can very quickly run into namespacing issues.</p>\n</li>\n<li><p>A local scope refers to any scope defined inside the global scope. Each function defined has its own local scope.</p>\n<pre><code class=\"lang-javascript\">// scope 1: Global scope out here\nconst myFunction = () =&gt; {\n  // scope 2: Local scope in here\n};\n</code></pre>\n<p>Locally scoped items are not available to the global scope.</p>\n</li>\n<li><p>When we define a function inside a function, the inner function has access to the scope of the outer function. But not the other way around. This is Closure! Thats all it is!!</p>\n<pre><code class=\"lang-javascript\">// scope 1: Global scope out here\nconst myFunction = () =&gt; {\n  // scope 2\n  const number = 1;\n  const myOtherFunction = () =&gt; {\n    // scope 3: `number` is accessible here!! We&#39;ve created a closure because stuff defined in there isnt accessible outside of this function\n  };\n};\n</code></pre>\n</li>\n</ul>\n<h3 id=\"anatomy-of-a-function\">Anatomy of a function</h3>\n<p>When we approach a function, one of the most valuable abilities is to comfortably understand what the goals\nand the use cases of a function are. This can be difficult when a function is not named well, however eventually\neven a poorly named function can be parsed by someone with enough experience and knowledge - for example:</p>\n<pre><code class=\"lang-javascript\">function myThing(someParam){\n  return someParam * 10;\n}\n</code></pre>\n<p>The naming of this function is no good - but even then, it becomes clear quickly what happens when this function is used,\nand how it is intended to be used.</p>\n<p>There are two big things we&#39;ll focus on here, the <code>parameters</code> and the <code>return</code> of a function.</p>\n<h4 id=\"parameter\">Parameter</h4>\n<p>The parameters should inform you almost immediately what expected information this function needs to work. If these parameters are not \npassed in, odds are, this function is not going to behave as intended, or will most likely throw an error (you can make functions durable to prevent this, but that&#39;s neither here nor there).</p>\n<p>In the above example, we have just one parameter, and it is named poorly. However, lets take a look at whats going on <strong>in</strong> the function.\nwe have this line</p>\n<pre><code class=\"lang-javascript\">return someParam * 10;\n</code></pre>\n<p>now, we can infer something from this line. That if someParam was anything but a number, it wouldn&#39;t work as intended - thus,\nsomeParam is probably intended and expected to be a number. Let&#39;s try updating the function to be a bit clearer:</p>\n<pre><code class=\"lang-javascript\">function myThing(aNumber){\n  return aNumber * 10;\n}\n</code></pre>\n<p>Now this is a bit clearer. On first pass, it&#39;s clear now that the first parameter being passed in should be a number.</p>\n<h4 id=\"return\">Return</h4>\n<p>So we figured out the conceptual &#39;beginning&#39; of the function interpretation, and that is resolving the values of the parameters. This lets us know what to replace, algebraically, in the function definitions body.\nSo what&#39;s the next most important thing? Well really, what the &#39;result&#39; of this function is going to be. That&#39;s what the return keyword is used for.</p>\n<p>Before we go into it, let&#39;s talk about how the interpreter deals with functions. When a function is <strong>called</strong>, we know because of the <code>()</code> at the end.\nFor example:</p>\n<pre><code class=\"lang-javascript\">myThing(5);\n</code></pre>\n<p>We can see above that myThing is being called. The interpreter, will then take that <code>5</code> we passed in, and replace the <code>aNumber</code>\nparameter with it. However, it&#39;s not done yet.</p>\n<p>Let&#39;s take a new function as an example:</p>\n<pre><code class=\"lang-javascript\">function someNewFunction() {\n  console.log(&#39;hello world&#39;);\n}\n\nsomeNewFunction(); // console logs &#39;hello world&#39;\n</code></pre>\n<p>Now that function works great, but what happens when we do this?</p>\n<pre><code class=\"lang-javascript\">let x = someNewFunction();\n`\n</code></pre>\n<p>What does <code>x</code> resolve to here? And does that console log still fire? Well the answer is that first,\nif no explicit return statement is defined for a function, at the end it, it just returns <code>undefined</code>.\nSecond, it&#39;s important to remember that when you call a function, everything inside -still- gets called,\neven if there is no return statement. So that <code>console.log</code> does fire.</p>\n<p>So let&#39;s get back to our <code>myThing</code> function. Let&#39;s take a look at what it&#39;s returning:</p>\n<pre><code class=\"lang-javascript\">return aNumber * 10;\n</code></pre>\n<p>When the interpreter gets here, it first wants to handle the operation it sees. Let&#39;s assume that what we\npassed into this function resolves aNumber as <code>5</code> - this becomes <code>5 * 10</code> which of course is <code>50</code>. So the final statement is\n<code>return 50</code>. I know this seems pedantic or overly specific, but this thought process is foundational.</p>\n<p>So, with this information, we know a bit more about what this function is doing. It&#39;s really simple, it takes a number and it returns\nthat same number times 10. Let&#39;s utilize this information to first better name the function</p>\n<pre><code class=\"lang-javascript\">\n/** as a side note, this is still a pure function, as a pure function is defined by a function that always\nreturns the same value no matter what, as long as the inputs are the same, and has no internal dependencies that may change,\n as well as having no hidden &#39;outputs&#39; - eg, it doesn&#39;t access an external object and mutate its value(s)\n **/\nfunction multiplyNumberByTen(aNumber){\n  return aNumber * 10;\n}\n\nlet numberResult = multiplyNumberByTen(5);\n</code></pre>\n<p>Now the first thing to note is that this is a lot more understandable. Reading just the implementation of the function\nshould give you a clear idea of the purpose. This is just a good practice, and something I&#39;ll be encouraging and noting in your own code.</p>\n<p>Additionally, because our function is returning a value, our <code>numberResult</code> gets set to that returned value, which in this case is <code>50</code>.</p>\n<h3 id=\"interpreting-our-code\">Interpreting our code</h3>\n<p>Everyone should behave a little bit like an interpreter when reading code. Going through your code in the right order and resolving\nexpressions and operations is not something that comes naturally, but with time and practice. So let&#39;s practice</p>\n<p>Let&#39;s use this function we just made, <code>multiplyNumberByTen</code> - and play around with it a little bit.</p>\n<pre><code class=\"lang-javascript\">let numberResult = multiplyNumberByTen(1) + multiplyNumberByTen(3) * multiplyNumberByTen(2);\n\nfunction multiplyNumberByTen(aNumber){\n  return aNumber * 10;\n}\n</code></pre>\n<p>So the first thing to note here is that we are using this function more than once. That&#39;s good! A good function can be used\nmultiple times, and in fact that&#39;s one of the main reasons we try and aim for what we call &#39;pure functions&#39; - because pure functions\nare always more reusable.</p>\n<p>Here we are using this multiplying function 3 times, and we are doing some math with them. Let&#39;s look at this differently,\nwe know that this function takes a number, multiplies it by 10 and returns it - so if we pass in <code>1</code> - the result is <code>1</code>, if we\npass in <code>3</code> the result is <code>30</code> and <code>2</code> would be <code>20</code>. So another way to view this, is like so</p>\n<pre><code class=\"lang-javascript\">let numberResult = 10 + 30 * 20;\n</code></pre>\n<p>At first glance you might think &#39;oh easy, this is equal to 800&#39; - because 10 + 30 = 40, and 40 <em> 20 = 800. However, \nthe rules of math that we know and love apply here - there is an order of operations that we need to consider, on -top- of how the interpreter\nreads this code. So the answer instead is `10 + (30 </em> 20)<code>, which is</code>10 + 600<code>, ie,</code>610`.</p>\n<p>At this point, we start to see how interesting it can get to work with functions, so let&#39;s kick it up a notch.</p>\n<pre><code class=\"lang-javascript\">let numberResult = multiplyNumberByTen(multiplyNumberByTen(2) + 2);\n\nfunction multiplyNumberByTen(aNumber){\n  return aNumber * 10;\n}\n</code></pre>\n<p>Now this might start to look a bit intimidating, but let&#39;s break it down and demystify. We have an expression being passed into\na function call it looks like! Not only that, part of the expression is a function itself - how does this all work, what is the order?</p>\n<p>Well, one thing to remember, is that before any variables or expressions are passed into a function as an argument, they need to be resolved\nfirst, so it&#39;s a good idea to start there, specifically <code>multiplyNumberByTen(2) + 2</code> - this is the expression that we need to resolve first.</p>\n<p>Looking at the previous explanation, we can figure out that the result if this is <code>20 + 2</code>, ie <code>22</code>. At this point, we have a nice number we can pass into\nour function, which ends up returning <code>222</code>;</p>\n<h3 id=\"functions-as-callbacks-\">Functions as &#39;callbacks&#39;</h3>\n<p>Something to always remember is that there is a difference between a function definition and a function being &#39;executed&#39; or &#39;called&#39;.\nThat seems pretty basic, but it can really get confusing when we get into the idea of passing around function definitions. Let&#39;s take a look\nat an example:</p>\n<pre><code class=\"lang-javascript\">let helloWorld = function(name){\n  console.log(`Hello ${name}!`);\n}\n\nconsole.log(helloWorld);\n</code></pre>\n<p>Above, the result of the console log is just going to be the definition of the function, try something like this in your browser console\nwindow if you like, and you&#39;ll see that a function&#39;s definition can be passed around - and in fact this is something you&#39;ve done\nall the time in javascript, and if you&#39;re like me, you had no idea what exactly was happening. Let&#39;s explain with another example</p>\n<pre><code class=\"lang-javascript\">\nfunction hollerBackFunc(callBackFunction){\n  return callBackFunction(10);\n}\n\nconst doubler = (num) =&gt; num * 2;\nconst addFive = (num) =&gt; num + 5;\nconst squarer = (num) =&gt; num * num;\n\nconst result1 = hollerBackFunc(doubler); // 20\nconst result2 = hollerBackFunc(addFive); // 15\nconst result3 = hollerBackFunc(squarer); // 100\n</code></pre>\n<p>What is happening here!? Let&#39;s take it a step at a time. First, let&#39;s note that we have a bunch of functions defined here,\nspecifically <code>hollerBackFunc</code>,<code>doubler</code>, <code>addFive</code> and <code>squarer</code>. The last 3 are more or less self explanatory, but if the arrows are giving you trouble:\n<a href=\"https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Functions/Arrow_functions\">https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Functions/Arrow_functions</a>\nAnd feel free to ask for help if they still give you trouble!</p>\n<p>Let&#39;s take a look at <code>hollerBackFunc</code>. This function looks mostly familiar, but the weirdest thing about it is that\nit seems to be executing one of it&#39;s parameters as though it were a function - well that&#39;s because it is. Functions can expect almost anything\nto get passed into them. That means arrays, numbers, strings, objects and yes - function definitions. Now unlike a function that has\nalready been called and is resolved before being passed in, an &#39;uncalled&#39; function is passed in as is. So in the case of\n<code>hollerBackFunc</code> - the first parameter it can expect is a function. Additionally, this function is then called <strong>inside</strong>\n<code>hollerBackfunc</code>, and 10 is always passed into whatever it gets. The result if <strong>that</strong> is then returned. So let&#39;s take a look at\nthat with <code>doubler</code>.</p>\n<p><code>doubler</code> takes any number passed in, and doubles it, then returns the result - easy peasy. So with the line</p>\n<pre><code class=\"lang-javascript\">const result1 = hollerBackFunc(doubler); //20\n</code></pre>\n<p><code>doubler</code> replaces the parameter <code>callBackFunction</code> inside of <code>hollerBackFunc</code>. So let&#39;s imagine that instead of <code>callBackFunction</code>,\nwe have <code>doubler</code>. It should look something like this in your head:</p>\n<pre><code class=\"lang-javascript\">function hollerBackFunc(/is now doubler*/){\n  return (num =&gt; num * 2)(10);\n}\n</code></pre>\n<p>I cheated a bit and just wrote the definition of doubler inline, wrapped it in parenthesis and passed 10 into it. The reality is,\nthat is more or less what is happening. If you try copying <code>(num =&gt; num * 2)(10)</code> and pasting it in the console, you&#39;ll see it works.</p>\n<p>Now the result of that is 20, and that is returned out to the result of hollerBackFunc! We&#39;ll be approaching this idea\nrepeatedly throughout the course, so don&#39;t be perturbed if it doesn&#39;t immediately click, but still feel free to ask for more info.</p>\n<h3 id=\"recursion-\">Recursion!</h3>\n<p>Here is a very simple example of recursion.</p>\n<pre><code class=\"lang-javascript\">function subtractByNumUntilANegative(startingNumber, numberToSubtractBy){\n\n  let newTotal = startingNumber - numberToSubtractBy;\n\n  return newTotal &lt; 0 ? newTotal : subtractByNumUntilANegative(newTotal, numberToSubtractBy);\n\n}\n</code></pre>\n"}}