{"module":{"contents":{"data":{}},"title":"Promises","path":"1-Javascript-General-Topics/promises","id":"promises","body":"<h2 id=\"promises\">Promises</h2>\n<p>Promises are now officially in Javascript, as of ES2015! So we should probably try and figure out what promises are.</p>\n<p>First, let&#39;s talk about the problem that Promises are solving. In javascript, asynchronous code (that&#39;s code that does not immediately fire)\nhas always been complicated and difficult to deal with. Today there are a lot of different methods to do so, there are Promises, Observables, Generators and often a combination of all of these and more.\nSo what are these systems, tools and libraries trying to do? Well, let&#39;s talk about just how javascript <strong>runs</strong>. </p>\n<p>In Javascript, code is run in a single threaded manner (let&#39;s not get into WebWorkers right now) - meaning, that all code is run by the \nsame thread of thought, so to speak. That means everything needs to queue up and wait it&#39;s turn, and no skipping in the line.</p>\n<p>This get&#39;s complicated when you have async code. Let&#39;s take a look at <code>setTimeout</code>.</p>\n<pre><code class=\"lang-javascript\">const someValue = &#39;Hello&#39;;\nlet theSecondHalf = &#39;&#39;;\nsetTimeout(() =&gt; theSecondHalf = &#39;World&#39;, 0);\nconsole.log(someValue + theSecondHalf);\n</code></pre>\n<p>Well, looking at this code, some might intuitively think &quot;well, we have someValue equalling Hello, theSecondHalf being blank\nat first but on the next line we give it a value, then right after that we give it a value of &#39;world&#39; so then on the last line it should say &#39;HelloWorld&#39; in the console.&quot;.</p>\n<p>The reasoning above seems right, but this is where the complicated nature of async code comes in. SetTimeout, no matter what, is an asynchronous action. That means no matter what,\nthe function inside is <strong>not</strong> part of the immediate stack. It get&#39;s put in the queue and is called at the next available opportunity (when the current stack clears).</p>\n<p>So that means that <code>console.log()</code> fires <em>before</em> the function that sets <code>theSecondHalf</code> to &#39;World&#39; does.</p>\n<p>Now this can be annoying, especially if I don&#39;t have any control over when the async event is firing - like with a network request. So promises are a way to communicate better with these\nasync events. Now, what we do, is wait for our async events.</p>\n<h3 id=\"our-first-promise\">Our first promise</h3>\n<pre><code class=\"lang-javascript\">let myPromise = new Promise((res, rej) =&gt; setTimeout(()=&gt; res(&#39;yay&#39;), 3000));\n\nmyPromise.then(response =&gt; console.log(response));\n</code></pre>\n<p>So let&#39;s break this down a little bit. First, let&#39;s take a look at this <code>new</code> keyword. We seem to be calling it right in front of a function - and this tells us the function is a <code>constructor</code>.\nI won&#39;t get into the details of what that entails, but just know that a constructor is a special kind of function that always returns an object. This object, in this case, is a <code>Promise</code>. So that means\nthat &#39;myPromise&#39; ends up equalling a promise object, which comes with a few useful methods, one of which we&#39;ll get into later.</p>\n<p>Now this promise is getting something passed into it - and that is a function, specifically:</p>\n<pre><code class=\"lang-javascript\">(res, rej) =&gt; setTimeout(()=&gt; res(&#39;yay&#39;), 3000)\n</code></pre>\n<p>This is passed into the Promise, and it is a callback function, which if you remember is a function definition passed into another function. Additionally,\nany function you pass into a Promise constructor can expect two parameters to be passed in. This is where it gets tricky - the two parameters that you can expect are\n<strong><em>also</em></strong> functions. You can see that in this example, we are even calling one of them, <code>res</code>. If you&#39;re not confused at this point, congratulations, you&#39;re a loooot smarter than me. This can get really dicey,\n and this is why we&#39;ll continue to go over the fundamentals of a function. Anyway, this res - what is it doing? Well we can see that inside of the callback function above,\n we are calling <code>setTimeout</code>, and waiting 3 seconds (3000ms) before firing the res function inside. So what that looks like is, 3 seconds after we create the function,\n <code>res</code> is fired, and additionally, it is provided the value <code>&#39;yay&#39;</code>. So that looks cool - but how does that practically change or do anything? Well this is where we get \n back to that <code>myPromise</code> variable:</p>\n<pre><code class=\"lang-javascript\">myPromise.then(response =&gt; console.log(response));\n</code></pre>\n<p>Right here, we can see that myPromise, the promise object returned by the promise constructor, has a cool function that comes with it called <code>then</code>. We didn&#39;t define this, all\npromises come with it. What <code>then</code> does can be a little confusing, because we can see that it <strong><em>also expects a callback</em></strong>. This callback function has one specific purpose though.</p>\n<h3 id=\"what-is-then-doing-\">What is &#39;then&#39; doing?</h3>\n<p>So <code>then</code> takes a function as it&#39;s first (and second, but we&#39;ll get into it later), parameter. <em>This function get&#39;s called right after the resolve in the promise constructor get&#39;s called</em>. Meaning, in the \nexample above, it get&#39;s called 3 seconds after myPromise get&#39;s defined! You can also see that this callback function expects something as well, and we are console logging that result.</p>\n<p>Can you guess what that result is? It&#39;s &#39;yay&#39;! That same string I passed in the constructor is available, three seconds later, in this function.</p>\n<p>This may seem a bit useless, and in this example it really is, but when we get to RESTful calls, you&#39;ll see it&#39;s value. In the next less on promises, we&#39;ll talk about the <code>reject</code> that we conveniently avoided today!</p>\n"}}