{"module":{"contents":{"data":{}},"title":"Git Fork","path":"7-Git/git-fork","id":"git-fork","body":"<h1 id=\"git-forking-a-repository\">Git: Forking a repository</h1>\n<blockquote>\n<p><em>Ah, the life! Branching, committing, pushing, pulling, merging... modifying code to my hearts&#39; content... breathing life into features like some sort of magician or squashing bugs like an exterminator. Bliss. Until...</em></p>\n</blockquote>\n<pre><code class=\"lang-bash\">! [remote rejected] master -&gt; master (protected branch hook declined)\nerror: failed to push some refs to &#39;git@github.com:some-account/some-repo.git&#39;\n</code></pre>\n<p>☹️</p>\n<p>When working with code, there are times when you will want to modify code that resides in a repository that is not under your control, or you may just not want to work with that repo or its maintainers directly. You might want to introduce features that are outside the scope of the project. You may want to build something completely unrelated and just use the repository as a starting point. Maybe a useful library needs a bug fix, but the maintainer has abandoned the repository. </p>\n<p>For all these times and <a href=\"#why-would-we-want-a-fork\">more</a>, there&#39;s <strong>Forking</strong>!</p>\n<p>Read on, or <a href=\"#the-short-version\">skip to the short version</a>!</p>\n<h2 id=\"what-is-a-fork-\">What is a Fork?</h2>\n<p>Forking is creating a new copy of the entire repository. This might sound like <code>git clone</code>, and behind the scenes it is. The difference is in where the new copy resides. A &quot;clone&quot; typically refers to a <em>local</em> copy of some repository. A <em>fork</em>, in contrast, is a second <em>remote</em> repository distinct from the original.</p>\n<p>Historically, a <em>fork</em> was created when a developer or team wanted to take a project in a new direction, or carry on the original mission while the core project undergoes some major shift. Some examples of this are <a href=\"http://anandmanisankar.com/posts/nodejs-iojs-why-the-fork/#why-the-fork\">NodeJS being forked as IO.js</a>, or when Oracle&#39;s take over of <code>OpenOffice</code> <a href=\"https://en.wikipedia.org/wiki/LibreOffice#ooo-build,_Go-oo_and_Oracle\">led to the LibreOffice fork</a>, and ultimately OpenOffice&#39;s demise. These classic situations can be referred to as <strong>hard forks</strong>, where the forked code is not meant to be integrated back into the original (upstream) codebase. What we deal with most often are so called <strong>soft forks</strong>, where we <em>do</em> intend for our changes to be integrated back into the original repository, and the fork is a convenient system for creating an isolated workspace. From here on when we say &quot;fork&quot; we will be talking about soft forks, unless explicitly stated otherwise.</p>\n<h2 id=\"how-do-i-make-a-fork-\">How do I make a fork?</h2>\n<p>You can do this manually by cloning a repository locally and then pushing to a new remote repository in a place of your choosing (GitHub, GitLab, BitBucket, etc). You would do so like this:</p>\n<pre><code class=\"lang-bash\">$&gt; git clone git@github.com:some-account/some-repo.git\n$&gt; git remote add myfork git@github.com:fork-account/fork-repo.git\n$&gt; git push myfork master\n</code></pre>\n<p>Note: more about <a href=\"#dealing-with-multiple-remotes\">managing <code>remote</code>s</a> below.</p>\n<p>GitHub and most other git-based version control services have forking built in as a feature that will automatically create a new repository under your account and copy the source repository into your new repository.</p>\n<p>On GitHub, for example, this can be accomplished simply by clicking the &quot;Fork&quot; button in the top right corner, just under your account avatar. See here:\n<img src=\"../images/github-fork.png\" alt=\"Forking on GitHub\"></p>\n<h2 id=\"why-would-we-want-a-fork-\">Why would we want a fork?</h2>\n<h3 id=\"why-not-just-branch-\">Why not just branch?</h3>\n<p>So far we have mostly discussed the reasons one may want or need to create a <em>hard</em> fork of some project, where we intend on making permanently incompatible changes, but we have not justified our more typical (soft) fork situation. As you recall, this is for work which we want to eventually merge back into the main repository. Some reasons for doing this are:</p>\n<ul>\n<li><strong>User workspaces:</strong> some projects involve a large number of developers (imagine a popular open source or large enterprise project) and if every developer pushes multiple branches of their work to the same repository, that repository can become very cluttered. When you synchronize your local instance in those cases, you will have many more branches listed than you need or care about as you&#39;ll see branches for everybody&#39;s work.</li>\n<li><strong>Clean main repository:</strong> as in the above case, but even for smaller teams, often the main repository is kept as the source-of-truth for the <code>master</code> (or <code>develop</code>) branch, and is otherwise reserved for CI and CD tasks, such as preserving production release versions. Branches for work-in-progress are relegated to user forks only in order to keep the central repo tidy.</li>\n<li><strong>Experimental changes:</strong> Sometimes you need to make large architectural changes or adjust CI/CD configuration, and it isn&#39;t acceptable to block work on the main repo. Configuring another pipeline against a fork is one option to get around this.</li>\n</ul>\n<h2 id=\"dealing-with-multiple-remote-s\">Dealing with multiple <code>remote</code>s</h2>\n<p>When you set up your local repository with multiple <code>remote</code> repositories (usually the main repository and your own fork), there are slight changes to some of the <code>git</code> commands you are accustomed to using. Specifically, for any commands that deal with remote repositories (<code>push</code>, <code>pull</code>, <code>fetch</code> etc), you now need to specify the repository with which you want to interact.</p>\n<p>For the following examples, imagine you cloned from your fork, so the repo copy under your account is the remote named <code>origin</code>, and we&#39;ve added a second remote called <code>upstream</code> for the main reposiory.</p>\n<h3 id=\"-pull-\"><code>pull</code></h3>\n<p>When pulling the latest changes for a tracked remote branch, you now specify the full source, including the remote name:</p>\n<pre><code class=\"lang-shell\">$&gt; git pull upstream master\n</code></pre>\n<h3 id=\"-push-\"><code>push</code></h3>\n<p>Now when you push a branch, you will need to specify the target remote by name:</p>\n<pre><code class=\"lang-shell\">$&gt; git push origin my-cool-feature\n</code></pre>\n<p>A common workflow is to push your work-in-progress feature branches to your fork, and then issue a Pull Request from there back to the main repository.</p>\n<h3 id=\"-fetch-\"><code>fetch</code></h3>\n<p>If you want to retrieve all of the latest changes from some remote (usually <code>upstream</code>), you can do so via <code>fetch</code>:</p>\n<pre><code class=\"lang-shell\">$&gt; git fetch upstream\n</code></pre>\n<h3 id=\"-rebase-\"><code>rebase</code></h3>\n<p><em>TBD</em> - should we cover this?</p>\n<h2 id=\"the-short-version\">The Short Version</h2>\n<p>If your team uses forks as part of their flow, after get acess to the main repository you should do the following:\n1) Create a personal fork of the repository on whichever platform the team uses.\n1) Clone <em>your fork</em> locally: <code>git clone git@github.com:your-account/shared-repo.git</code>\n1) Add the main repository as another remote: <code>git remote add upstream git@github.com:repo-owner-account/shared-repo.git</code>\n1) Checkout the <code>master</code> branch\n1) <a href=\"./git-branch-stage-commit.md\">Create a branch</a> for your feature: <code>git checkout -b feat/my-cool-feature</code>\n1) Develop! Commit! Get it to the point where you&#39;re ready to propose merging the code.\n1) Get the latest code from the upstream repo (other code may have been merged): <code>git fetch upstream</code>\n1) <a href=\"git-rebase.md\">Rebase</a> your branch against the latest version of <code>master</code> from <code>upstream</code>: <code>git rebase upstream/master</code>\n  1) Follow the steps, being very careful to resolve any <em>merge conflicts</em> if necessary.\n1) Push your rebased branch to your <code>origin</code>: <code>git push origin feat/my-cool-feature</code></p>\n<h2 id=\"gotchas\">Gotchas</h2>\n<p>Sometimes you will need to rebase your branch after you push it, because somebody else had made a change to the code and you need to update your branch before your PR can be merged. Just <code>fetch</code> the latest changes, and <code>rebase</code> as above. When this happens, you may encounter an error when you go to push your code to your <code>origin</code>:</p>\n<pre><code>ADD ERROR HERE\n</code></pre><p>This is because rebasing <em>changes your commits</em>. Your updated commits (and any new ones) are no longer compatible with the commits you push before. You have to overwrite them:\n<code>git push origin feat/my-cool-feature -f</code>\nThe <code>-f</code> t the end of the commend tells git to do a &quot;force&quot; push, which replaces all the commits that are on the remote branch with your new rebased version.</p>\n<h2 id=\"check-your-understanding\">Check your understanding</h2>\n<ul>\n<li>How is a fork of a repository different than a clone?</li>\n<li>What are some reasons for forking?</li>\n<li>What do we mean by hard and soft forks?</li>\n</ul>\n<h2 id=\"more-resources\">More resources</h2>\n<p>Some further reading</p>\n<ul>\n<li><a href=\"https://help.github.com/articles/fork-a-repo/\">GitHub help article</a></li>\n<li><a href=\"TODO\">Atlassian&#39;s explanation</a></li>\n<li><a href=\"https://gregoryszorc.com/blog/2017/12/11/high-level-problems-with-git-and-how-to-fix-them/\">Another perspective on forks</a></li>\n</ul>\n"}}