{"module":{"contents":{"data":{}},"title":"Git Rebase","path":"7-Git/git-rebase","id":"git-rebase","body":"<h1 id=\"git-rebase\">Git rebase</h1>\n<h2 id=\"what-s-rebasing-\">What’s rebasing?</h2>\n<p>Git rebase takes a branch you select and merges it on to the branch where you’re currently working. Then it takes all of your local commits and applies them on top.</p>\n<h2 id=\"you-said-it-merges-the-branches-why-not-use-git-merge-\">You said it merges the branches. Why not use <code>git merge</code>?</h2>\n<p>Git rebase solves the same issues as git merge, but rebasing results in a cleaner, easier to understand commit history (better for everyone trying to understand the history of your project!). Rebasing keeps your history clean by moving your commits to the end of your git history, while git merge makes a merge commit every time you pull upstream changes, but keeps your commits at the same at the same point in history when they were made (resulting in a strange spliting of your changes in your git history). </p>\n<p>tl;dr: git rebase makes your commit history easier to read than git merge. To learn more about the difference between merging and rebasing (with handy diagrams!), check out this link: <a href=\"https://www.atlassian.com/git/tutorials/merging-vs-rebasing\">https://www.atlassian.com/git/tutorials/merging-vs-rebasing</a>  </p>\n<h2 id=\"when-should-i-rebase-\">When should I rebase?</h2>\n<p>One common reason for rebasing is to get changes from another branch and apply them to your own. Let’s say you and your team are busy working on your project. You’re coding on your local branch when someone else on your team finishes a feature and merges it to master. The new code your friend just pushed is a change you want on your local branch. You can use <code>git rebase &lt;nameOfYourFriendsBranch&gt;</code> to add these changes to your local branch and keep working.</p>\n<p>Another reason to rebase is to head off (or handle!) any potential merge conflicts. A merge conflict occurs when two branches have code edits on the same lines. Git doesn’t know which of the edits should be kept, so it throws a conflict that a human (you!) has to resolve. So if a teammate&#39;s branch is merged before yours and you and your teammate have both touched the same files, your branch could now have merge conflicts. The fix? Rebasing.</p>\n<p>Your team norms might dictate other times you need to rebase - for example, a team might agree that if your branch has <em>any</em> outdated changes from master, you rebase. </p>\n<h2 id=\"merge-conflicts-sound-terrible-how-can-i-make-sure-i-never-have-to-deal-with-them-\">Merge conflicts sound terrible. How can I make sure I never have to deal with them?</h2>\n<p>Alas, dealing with merge conflicts is a part of developer life. But they don’t have to be awful! To mitigate conflicts, commit your work often and rebase master when new code is added. If everyone on your team does this, you’ll keep your local branches up-to-date and lower the entire team&#39;s odds of having to fix a large merge conflict.</p>\n<p>Using the interactive mode when performing a rebase helps as well. Interactive mode can be used by adding the -i flag to your rebase command like so:</p>\n<p> <code>git rebase -i &lt;nameOfBranchToRebaseIn&gt;</code></p>\n<p>Using interactive mode when rebasing lets you see the commits that you&#39;re rebasing, and allows you to edit and squash commits.</p>\n<h2 id=\"what-is-git-squash-\">What is git squash?</h2>\n<p>Git squash allows you to take several commits and combine them into a single commit. Say you&#39;ve finished a feature - styling a nav bar - and your git history looks like this:</p>\n<pre><code>3f0e9cdcda init commit\n9845111670 in progress\ncd362d2f52 still working\n300571e57c styled nav bar\n</code></pre><p>To keep your git history clean and easy to read, you can combine all of these commits into a single commit and update your commit message. You can do this by rebasing your current branch into itself, and then squashing your commits together, like this:</p>\n<p><code>git rebase -i &lt;nameOfBranchYouAreOn&gt;~4</code></p>\n<p>The reason &quot;4&quot; is added to the end of the rebase message is because your branch currently has 4 commits that you want to make into a single commit. After you run this command, git will show you the commits you&#39;ve selected:</p>\n<pre><code>pick 3f0e9cdcda init commit\npick 9845111670 in progress\npick cd362d2f52 still working\npick 300571e57c styled nav bar\n</code></pre><p>You can squash your commits by keeping the first commit as is, and selecting &#39;squash&#39; for the other commits like so:</p>\n<pre><code>pick 3f0e9cdcda init commit\ns 9845111670 in progress\ns cd362d2f52 still working\ns 300571e57c styled nav bar\n</code></pre><p>Save your choices:\n<code>cmd + s</code>, then <code>cmd+ w</code></p>\n<p>Once you&#39;ve done this, git will give you the option of editing the commit messages for all of the commits you&#39;ve changed. You can edit your commit messages into a single commit that describes the work you&#39;ve done on the branch. When you&#39;re finished editing the messages, save and quit your editor.</p>\n<p>At this point you can push your new, squashed changes. Since you&#39;ve just changed the git history of your branch, you&#39;ll need to force push, so rather than:\n<code>git push</code></p>\n<p>you&#39;ll need:</p>\n<p><code>git push -f</code></p>\n<p>You use the -f flag to force update your git history on your remote branch after you rebase. If you don&#39;t force push your code, you&#39;ll get merge conflicts, and no one likes dealing with those.</p>\n<h2 id=\"when-shouldn-t-i-rebase-\">When shouldn&#39;t I rebase?</h2>\n<p>Once you&#39;ve pushed your code to your team&#39;s repo, don&#39;t rebase anymore. If your code is in the repo, other people on your team may have pulled your work and rebased their branches. Rebasing at this point can cause messiness and merge conflicts.</p>\n<p>Similairly, once you&#39;ve put up a PR and someone on your team has reviewed it and requested changes, don&#39;t rebase after you make these changes. You want to keep the history of your commits intact at this point so your reviewers can easily follow the work you&#39;ve updated.</p>\n<p>If you are curious about what’s going on under the hood when you run <code>git rebase</code>, you can read more about the mechanics of it here: <a href=\"https://git-scm.com/book/en/v2/Git-Branching-Rebasing\">https://git-scm.com/book/en/v2/Git-Branching-Rebasing</a></p>\n"}}