{"module":{"contents":{"data":{}},"title":"Observables Intro","path":"4-Observables/observables-intro","id":"observables-intro","body":"<h1 id=\"observables-introduction\">Observables: introduction</h1>\n<p>Since JavaScript is single-threaded, we often run into situations that involve asynchronous data flows.</p>\n<h2 id=\"what-are-asynchronous-data-flows-again-\">What are asynchronous data flows again?</h2>\n<p>Data from functions that are processed in their own time, where the results will arrive outside the regular flow of the app. </p>\n<p>For example, we often see this in the context of API calls when we request data from another server or backend service. We make a request for the data on the side and, once the data arrives, we put it in a queue to be processed. We don&#39;t actually stop and hold up all activity in the app until the data comes back. Instead, we put it to the side and process it when it arrives (and when we&#39;re ready) - [<em>insert link to event loop bridge content here</em>].</p>\n<p>We also encounter this with DOM events, timer intervals, web workers and web sockets.</p>\n<p><strong>Don&#39;t we already have a few ways to handle asynchronous data?</strong> \nYes, we can use callback functions and promises for example. But Observables are slightly different as they allow us to process <strong>streams of data</strong>.</p>\n<h2 id=\"why-should-i-care-\">Why should I care?</h2>\n<p>Observables play a key part in something called <strong>reactive programming</strong>. This is the concept of programming with asynchronous data streams (a sequence of values in time). You can choose to listen to these streams and, as data comes through them, react accordingly. </p>\n<p>Data streams are functional - so you can use streams as inputs into other streams, combine them, filter them, etc using a variety of helpful functions. </p>\n<p>Angular has Observables baked into core parts of its library, such as its event system and HTTP client service, using a third-party library called RxJS (Reactive Extensions). In addition, we&#39;re starting to see more React projects use RxJS to take advantage of Observables to manage streams.</p>\n<h2 id=\"what-is-an-observable-\">What is an Observable?</h2>\n<p>Observables originate from something called the <strong>observer design pattern</strong>. </p>\n<blockquote>\n<p>The observer pattern is a software design pattern in which an object, called the <strong>subject</strong>, maintains a list of its dependents, called <strong>observers</strong>, and notifies them automatically of any state changes, usually by calling one of their methods. (<a href=\"https://en.wikipedia.org/wiki/Observer_pattern\">source</a>) </p>\n</blockquote>\n<p>Ok, so that definition is pretty wordy and technical. </p>\n<p>In simple terms, the pattern involves an object (called an observable) that will share (or emit) data as it arrives over time. Throughout your code, many different objects (called observers) can sign up to be notified when that data arrives (called subscribing). So, whenever our observable recieves its data, it will broadcast that information out and the observers will be listening for it.  </p>\n<p>Some key points to note about the pattern:</p>\n<ul>\n<li>You can have one observable and many observers (a one-to-many dependancy). That is, one broadcaster and an unlimited number of recipients.</li>\n<li>When that observable changes, all observers should be updated/notified immediately and automatically</li>\n<li>It is the observer&#39;s responsibility to register and unregister themselves from the observable (to be notified of changes) and to update their own state when notified.</li>\n</ul>\n<h2 id=\"so-an-observable-\">So... an Observable?</h2>\n<p>Think of an observable as a box that you create to hold data from a service or function whose data or items will arrive over time. </p>\n<p>As the data arrives, the box notifies anyone that has requested they be updated and it does so in the way they&#39;ve asked.</p>\n<h2 id=\"basic-structure\">Basic structure</h2>\n<p>In its simpliest form, an Observable is a function that accepts an object (an observer) with next, error and complete methods on it. </p>\n<p>When you create an observable, you call its constructor and pass in a function. That function takes in an observer as a parameter and its body contains instructions for when to call each of the observer&#39;s methods. </p>\n<p>For example:</p>\n<pre><code class=\"lang-javascript\">const data = Observable.create(observer =&gt; {\n  setTimeout(() =&gt; observer.next(&#39;first&#39;), 1000);\n  setTimeout(() =&gt; observer.complete(), 3000);\n});\n</code></pre>\n<p>The newly created observable doesn&#39;t actually do anything until: </p>\n<ul>\n<li>a) someone subscribes and passes in an observer and </li>\n<li>b) data is emitted.</li>\n</ul>\n<p>When you subscribe to an observable, this is the equivilant to calling the observable like a function and passing in an observer. This tells the observerable that you&#39;d like to be notified when data arrives, and tells it which functions to run (via the observer object) to do that.</p>\n<pre><code class=\"lang-javascript\">this.data\n    .subscribe({\n        next: console.log,\n        error: console.error,\n        complete: () =&gt; console.info(&#39;complete&#39;)\n    });\n</code></pre>\n<p>Our observer contains 1 to 3 functions to be executed by the observable:</p>\n<ul>\n<li>next: function that will be executed each time a value is emitted (mandatory) </li>\n<li>error: function that will be executed when an error is emitted (optional)</li>\n<li><p>complete: function that will be executed when a &#39;completed&#39; is emitted (optional)</p>\n<p>```javascript\nthis.data\n .subscribe(myObserver);</p>\n</li>\n</ul>\n<p>const myObserver = {\n    next: console.log,\n    error: console.error,\n    complete: () =&gt; console.info(&#39;complete&#39;)\n}\n```</p>\n<p>Those functions you pass in as part of the observer object will stay active and listen for those events until you manually decide to unsubscribe from and stop listening to the observable.</p>\n<p>Note: <code>error</code> and <code>complete</code> are optional. But when these functions are called, they will trigger the unsubscription logic and the observer will stop listening to the observable. So if there is an error, the complete won&#39;t fire and vice versa.</p>\n<p>When you subscribe, the observable sets up your observer with the functions you pass in and, when it emits, it&#39;ll call those functions.</p>\n<h2 id=\"basic-example\">Basic example</h2>\n<p><a href=\"https://jsbin.com/penicovixi/edit?js,console\">Open in JSbin</a></p>\n<p><em>(example by Philip Da Silva)</em></p>\n<h2 id=\"how-do-observables-compare-\">How do Observables compare?</h2>\n<p>Callbacks:</p>\n<ul>\n<li>Not as scalable and they often can become overly nested (pyramid of doom)</li>\n</ul>\n<p>Promises:</p>\n<ul>\n<li>Good for one piece of data but they aren&#39;t as helpful for managing collections of data over time. For example, when you expect one value from a server and then for that promise to be fulfilled. </li>\n<li>They also aren&#39;t cancellable - they are always listening.</li>\n</ul>\n<p>Observables:</p>\n<ul>\n<li>Allow us to work with complex data over time (streams)</li>\n<li>Are cancellable</li>\n<li>Are compositional (you can build on them) and they are lazy (they do not start emitting data until an observer has subscribed)</li>\n<li>Allows us to chain together array-like operators and pass observable streams through to parse, modify and maintain the data within them. We&#39;ll look at these next.</li>\n</ul>\n<h2 id=\"resources\">Resources</h2>\n<ul>\n<li><a href=\"https://gist.github.com/staltz/868e7e9bc2a7b8c1f754\">The introduction to Reactive Programming you&#39;ve been missing</a></li>\n<li><a href=\"https://xgrommx.github.io/rx-book/why_rx.html\">RxBook</a></li>\n<li><a href=\"https://medium.com/@benlesh/learning-observable-by-building-observable-d5da57405d87\">Learning Observable By Building Observable</a></li>\n<li><a href=\"https://developer.telerik.com/topics/web-development/introduction-observables-angular-developers/\">An Introduction to Observables for Angular Developers</a></li>\n<li><a href=\"https://angular-2-training-book.rangle.io/handout/observables/\">Angular 2 Training: Observables</a></li>\n<li><a href=\"https://medium.com/@benlesh/hot-vs-cold-observables-f8094ed53339\">Hot vs Cold Observables</a></li>\n<li><a href=\"http://blog.rangle.io/observables-and-reactive-programming-in-angular-2/\">Observables and Reactive Programming in Angular 2</a></li>\n<li><a href=\"https://www.learnrxjs.io/\">Learn RxJS</a></li>\n<li><a href=\"http://reactivex.io/rxjs/\">RxJS</a></li>\n</ul>\n"}}